Catalogs/НастройкиОтраженияДокументовВБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиОтраженияДокументовВБухгалтерии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияДанныхЧерезУниверсальныйФормат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтражения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазделыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиОтраженияДокументовВБухгалтерии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ТекущаяНастройка() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОтраженияДокументовВБухгалтерии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии КАК НастройкиОтраженияДокументовВБухгалтерии
	|ГДЕ
	|	НЕ НастройкиОтраженияДокументовВБухгалтерии.ПометкаУдаления");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

Функция ПользовательДляИнтеграции(НастройкаСсылка) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "ПользовательДляИнтеграции");
	
КонецФункции

Функция ОписаниеНастройки(НастройкаСсылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("УзелОбмена", ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.ПустаяСсылка());
	Результат.Вставить("ДатаНачалаОтражения", '00010101');
	Результат.Вставить("ОтражениеВключено", Ложь);
	Результат.Вставить("Организации", Неопределено);
	Результат.Вставить("РазделыУчета", Неопределено);
	Результат.Вставить("ВидыДокументов", Неопределено);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиОтражения.Код КАК Идентификатор,
	|	НастройкиОтражения.УзелОбмена КАК УзелОбмена,
	|	НастройкиОтражения.ДатаНачалаОтражения КАК ДатаНачалаОтражения,
	|	НастройкиОтражения.ОтражениеВключено КАК ОтражениеВключено
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии КАК НастройкиОтражения
	|ГДЕ
	|	НастройкиОтражения.Ссылка = &НастройкаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОтраженияОрганизации.Организация КАК Организация
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии.Организации КАК НастройкиОтраженияОрганизации
	|ГДЕ
	|	НастройкиОтраженияОрганизации.Ссылка = &НастройкаСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиОтраженияОрганизации.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОтраженияРазделыУчета.Идентификатор КАК Идентификатор
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии.РазделыУчета КАК НастройкиОтраженияРазделыУчета
	|ГДЕ
	|	НастройкиОтраженияРазделыУчета.Ссылка = &НастройкаСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиОтраженияРазделыУчета.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОтраженияВидыДокументов.РазделУчета КАК РазделУчета,
	|	НастройкиОтраженияВидыДокументов.ИдентификаторМетаданных КАК ИдентификаторМетаданных
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии.ВидыДокументов КАК НастройкиОтраженияВидыДокументов
	|ГДЕ
	|	НастройкиОтраженияВидыДокументов.Ссылка = &НастройкаСсылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиОтраженияВидыДокументов.НомерСтроки");
	
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Результат.Организации = РезультатыЗапроса[1].Выгрузить().ВыгрузитьКолонку("Организация");
	Результат.РазделыУчета = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку("Идентификатор");
	Результат.ВидыДокументов = РезультатыЗапроса[3].Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиУзлаОбмена() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ВариантНастройки КАК ВариантНастройки,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ВерсияФорматаОбмена КАК ВерсияФорматаОбмена,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ВыгружатьДополнительныеРеквизиты КАК ВыгружатьДополнительныеРеквизиты,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ВыгружатьКартинкиНоменклатуры КАК ВыгружатьКартинкиНоменклатуры,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ВыгружатьОстаткиНоменклатуры КАК ВыгружатьОстаткиНоменклатуры,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ДатаНачалаВыгрузкиДокументов КАК ДатаНачалаВыгрузкиДокументов,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ИспользоватьОтборПоВидамДокументов КАК ИспользоватьОтборПоВидамДокументов,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ИспользоватьОтборПоВидамЦен КАК ИспользоватьОтборПоВидамЦен,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ИспользоватьОтборПоНоменклатуре КАК ИспользоватьОтборПоНоменклатуре,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ИспользоватьОтборПоОрганизациям КАК ИспользоватьОтборПоОрганизациям,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ОбобщенныйСклад КАК ОбобщенныйСклад,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ПереноситьЗаказыКакСчетаНаОплату КАК ПереноситьЗаказыКакСчетаНаОплату,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ПереноситьКатегорииКакВидыНоменклатуры КАК ПереноситьКатегорииКакВидыНоменклатуры,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.РежимВыгрузкиКартинокНоменклатуры КАК РежимВыгрузкиКартинокНоменклатуры,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.РежимВыгрузкиПриНеобходимости КАК РежимВыгрузкиПриНеобходимости,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.РежимВыгрузкиСправочников КАК РежимВыгрузкиСправочников,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.РежимСинхронизацииДанных КАК РежимСинхронизацииДанных,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.РучнойОбмен КАК РучнойОбмен,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.СтатьяПриход КАК СтатьяПриход,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.СтатьяРасход КАК СтатьяРасход,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.НеВыгружатьПеремещенияЗапасов КАК НеВыгружатьПеремещенияЗапасов,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена.ВыгружатьНаОбобщенныйСклад КАК ВыгружатьНаОбобщенныйСклад,
	|	НастройкиОтраженияДокументовВБухгалтерии.УзелОбмена КАК УзелОбмена,
	|	НастройкиОтраженияДокументовВБухгалтерии.НастройкиПриложения КАК НастройкиПриложения
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии КАК НастройкиОтраженияДокументовВБухгалтерии
	|ГДЕ
	|	НЕ НастройкиОтраженияДокументовВБухгалтерии.ПометкаУдаления");
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	КонецЕсли;
	
КонецФункции

Процедура УстановитьПризнакОтражениеВключено(НастройкаСсылка, ОтражениеВключено = Истина) Экспорт
	
	СвойстваНастройки = Новый Структура;
	СвойстваНастройки.Вставить("ОтражениеВключено", ОтражениеВключено);
	
	ОбновитьНастройку(НастройкаСсылка, СвойстваНастройки);
	
КонецПроцедуры

Процедура ЗафиксироватьСостояниеОбновления(НастройкаСсылка, ДатаОбновления = Неопределено, ПроверкаВыполнена = Ложь) Экспорт
	
	СвойстваНастройки = Новый Структура;
	
	Если ДатаОбновления <> Неопределено Тогда
		СвойстваНастройки.Вставить("ДатаПоследнегоОбновленияУниверсальная", ДатаОбновления);
	КонецЕсли;
	
	СвойстваНастройки.Вставить("ПроверкаВыполнена", ПроверкаВыполнена);
	
	ОбновитьНастройку(НастройкаСсылка, СвойстваНастройки);
	
КонецПроцедуры

Функция ПроверитьКорректностьНастроекНаУзлеОбмена(ОписаниеНастройки) Экспорт
	
	// Проверка корректности настроек на узле обмена.
	// Режим отправки документов: отправлять автоматически с даты = ДатаНачалаОтражения
	// Включен отбор по организациям.
	// Настроены сценарии синхронизации, включен запуск по расписанию.
	
	Возврат Истина;
	
КонецФункции

Функция СписокОтражаемыхОрганизаций() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиОтраженияДокументовВБухгалтерии.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТекущаяНастройка
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии КАК НастройкиОтраженияДокументовВБухгалтерии
	|ГДЕ
	|	НЕ НастройкиОтраженияДокументовВБухгалтерии.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОтраженияДокументовВБухгалтерииОрганизации.Организация КАК Организация
	|ИЗ
	|	Справочник.НастройкиОтраженияДокументовВБухгалтерии.Организации КАК НастройкиОтраженияДокументовВБухгалтерииОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущаяНастройка КАК ТекущаяНастройка
	|		ПО НастройкиОтраженияДокументовВБухгалтерииОрганизации.Ссылка = ТекущаяНастройка.Ссылка");
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат.ВыгрузитьКолонку("Организация");
	Иначе
		Возврат Новый Массив;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьНастройку(НастройкаСсылка, СвойстваНастройки)
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиОтраженияДокументовВБухгалтерии");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", НастройкаСсылка);
		
		Блокировка.Заблокировать();
		
		НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
		
		ЕстьИзменения = Ложь;
		
		Для Каждого ТекущееСвойство Из СвойстваНастройки Цикл
			Если НастройкаОбъект[ТекущееСвойство.Ключ] <> ТекущееСвойство.Значение Тогда
				НастройкаОбъект[ТекущееСвойство.Ключ] = ТекущееСвойство.Значение;
				ЕстьИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьИзменения Тогда
			НастройкаОбъект.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
